{"pages":[],"posts":[{"title":"첫 투고","text":"한 번 마음 잡고 깃 블로그를 운영하고자 합니다. 기타 설정은 물론, 아직 검색엔진조차 제대로 설정하지 않아 구글이나 네이버에 검색도 안되기 때문에, 아마 이 글을 보시는 분들은 제 깃허브를 통해 들어오신 분들일 듯 합니다. (국비지원 동기들 보고 있나)거창한 건 없고, 프로필 제목 처럼 제 지식을 간단하게 아카이브로 남기고자 합니다. 첫 투고이니 간단하게 제 소개를 하자면, 국비지원으로 IT공부를 시작한 비전공자 개발조무사 라고 생각합니다. 비전공자를 비하하는 게 아니라 제 실력이 그렇다는 겁니다. 사실 이 포스팅도 꽤 고민 끝에 수정하였는데, 다음부터는 착실하게 포스팅 하고자 합니다. 그럼 다음 게시물부터 본격적으로 시작하겠습니다.","link":"/2021/09/04/2021-09-04-001-hello-world/"},{"title":"Hexo 블로그 설치 A to Z","text":"[1] 설치 및 배포 관련 (사전에 Git 설치 필요) [공식] Hexo 공식 사이트 [공식] Hexo 설치 공식 가이드 1 [공식] Hexo 설치 공식 가이드 2 [개인] 헥소(HEXO)를 이용한 깃허브 블로그 만들기 [개인] 워드프레스보다 쉬운 Hexo 블로그 시작하기 [개인] Hexo 기본 사용법 [개인] Hexo 이카루스 테마 [2] 간단 명령어 모음 게시물 생성 Terminal1$ hexo new &quot;My New Post&quot; More info: Writing 서버 실행 (본인 프로젝트 파일 경로에서 Terminal로 실행) Terminal1$ hexo server More info: Server 정적 파일들 생성 Terminal1$ hexo generate More info: Generating 원격 사이트에 배포 ex) Github Terminal1$ hexo deploy More info: Deployment Ex) 현재 본인의 배포 키워드 Terminal12C:\\Users\\blog&gt;hexo clean &amp;&amp; hexo generateC:\\Users\\blog&gt;hexo deploy","link":"/2021/09/04/2021-09-04-002-install-hexo/"},{"title":"Markdown 기초 문법","text":"[1] 들어가기 앞서 이것부터 말합니다. MarkDown은 MarkUp 언어와 동일하게 Java, Ruby, Javascript와 같은 프로그래밍 언어는 아닙니다. [2] 설명 MarkUp 이란? 쉽게 말씀드리면 MarkUp은 Tag라는 것을 이용하여 문서의 구조를 명시하는 언어입니다. 우리가 많이 보던 HTML, XML, SVG 등이 해당됩니다.(JSON, YAML 파일은 분류는 마크업으로 되어 있지만, 구조와 쓰임이 다릅니다) MarkDown 이란? MarkUp이 Tag를 이용한 것이라면, MarkDown은 일반 텍스트로 쓰는 마크업 언어입니다. 우리가 메모장에서 텍스트를 적는 것처럼 쓰는데, 유용한 기능이 추가된 언어라고 생각하면 편합니다. 파일의 확장자는 .md 이며, Hexo에서의 간단 사용 방식은 아래에 기술합니다. [3] 기초적인 문법 글쓰기 123456789텍스트 적듯이 적습니다.**해당 문장의 글씨를 두껍게, 즉 강조를 할 수 있습니다***이탈릭체(비스듬한 글씨체)는 이런 식으로 적습니다****두꺼우면서 비스듬하게 적으려면 별표를 세 번 합니다***~~취소선은 이런 식으로 적습니다~~&lt;u&gt;밑줄을 적을 수도 있습니다&lt;u&gt;위의 순서대로 네 기능은 각각 __할말__ _할말_ ___할말___ ~할말~ 로 써도 가능합니다. 인용구 1234567891011&gt; 텍스트 적듯이 적습니다.&gt;&gt; 로 중첩된 인용문 사용 가능&gt;&gt;&gt; 로 또 중첩된 인용문 사용 가능또는 {% blockquote %}이런 식으로도 적습니다. {% endblockquote %}또한 blockquote 쪽에 [author[, source]] [link] [source_link_title] 등 여러 정보를 추가할 수 있습니다. 코드 블럭(or 블럭 내 텍스트) 3-1. 기본 1234567'''텍스트 적듯이 적습니다. 단, '''을 ```로 바꾸어야 합니다.'''''' Python이와 같이 특정 언어의 코드 블럭을 생성할 수도 있습니다. ex) MarkDown, Javascript, Python, Ruby...''' 3-2. Python용 코드 블럭 예시 12for i in range(1, 10, 1): print(f&quot;간단한 for문을 출력합니다. {i}번째&quot;) 3-3. 아래는 bash용 코드 블럭 예시 1$ vim ./~zshrc 제목(글자 크기) 123456(&lt;h1&gt; 에 해당) # 제목 1(&lt;h2&gt; 에 해당) ## 제목 2(&lt;h3&gt; 에 해당) ### 제목 3(&lt;h4&gt; 에 해당) #### 제목 4(&lt;h5&gt; 에 해당) ##### 제목 5(&lt;h6&gt; 에 해당) ###### 제목 6 iframe 및 타 영상 사이트 5-1. iframe 1{% iframe URL입력 가로길이 세로길이 %} 가끔씩 youtube 처럼 연결 거부로 뜨는 사이트가 있는데, embed 태그로 가져와야 합니다. 예를 들어, 1{% iframe https://www.youtube.com/embed/dQw4w9WgXcQ 100% 500 %} 이런 식으로 가져옵니다. 여기서 세로 길이는 100%으로 하면 매우 짧기 때문에 위와 같이 300~500을 추천합니다. 5-2. youtube 1{% youtube dQw4w9WgXcQ %} (유튜브 비디오 ID를 입력) 그 외 여러 삽입 기능이 있으니 찾아보시는 걸 추천드립니다. 링크 삽입 6-1. 하이퍼링크 1[유튜브](https://www.youtube.com/) 6-2. 이미지 1![이미지 제목](/img/이미지파일.png &quot;대체 텍스트&quot;) 위의 /img/~ 이 경로는 보통 자기가 설치한 테마 폴더가 기본 값인데, icarus 테마를 예시로 들자면, icarus 테마 폴더 내 source 폴더에 img 혹은 image라는 폴더가 있는데, 그곳에서 가져옵니다. 테이블 7-1. 기본 12345|제목|내용|설명||------|---|---||테스트1|테스트2|테스트3||테스트1|테스트2|테스트3||테스트1|테스트2|테스트3| 7-2. 기능 추가 12345|컬럼1|컬럼2||:-:|:-:||값1-1|값2-1||값1-2|값2-2||값1-3|값2-3| 자세한 설명은 여기 참고해 주시면됩니다. 요약문(포스트 미리보기) 1234미리보기에 보여질 내용미리보기에 보여질 내용미리보기에 보여질 내용&lt;!-- more --&gt; 드롭다운(접히기, 펴기) &lt;details&gt; &lt;summary&gt;접기/펼치기 버튼&lt;/summary&gt; &lt;div markdown=&quot;1&quot;&gt; 내용 &lt;/div&gt; &lt;/details&gt; [4] 참고 사이트 마크다운 문법 MarkDown(마크다운) 문법 MarkDown 사용법 총정리 (적극 추천) Hexo 공식 문서(왼쪽 탭에서 Basic Usage 부분 열람) 마크다운(Markdown) 문법 - 목록(리스트), 체크박스","link":"/2021/10/03/2021-10-03-001-markdown/"},{"title":"추천 영상 [1] - 개발자 유튜버를 너무 믿지 마세요!","text":"간략하게 소개하자면, 개발자 유튜버들이 어떤 기술이 좋으니 꼭 쓰라는 것에 대해충분한 고민을 하고 난 뒤 결정을 하라는 내용입니다. 해당 영상에서 느낀점을 적기엔 뭔가 감상문이 될 것 같아서 적지는 않겠습니다. 다만, 1년 하고도 좀 더 지난 영상임에도 지금 생각해도 맞는 말이라고 생각합니다. 한 번쯤 보시는 걸 추천합니다.","link":"/2021/10/03/2021-10-03-003-recommend-video/"},{"title":"DevOps란?","text":"지극히 주관적인 정보입니다. [1] 개요 여러분도 어디선가 들어봤을 겁니다, DevOps. 대체 이건 뭔교? 사실 이 포스트를 쓰면서 저도 감은 잡히지 않습니다. 다만 이게 개발 방법론이라고는 하는 듯 합니다. 개발 방법론? 그건 또 뭔교? 간단하게 설명드리면, 공동으로 개발을 하는 데 있어서, 이름 그대로 방법을 제시하는 것. 추상적인 말이지만, 실제 알고리즘을 구조를 제외하고, 이론을 이해를 하기엔 이만한 말이 없습니다. [2] DevOps 사실 위에서 개발 방법론을 설명했기에 이 종류를 쓰려고 했지만, 생각해보니 매우 따분해질 것 같아서 그냥 패스합니다. 우리는 (적어도 저는) 그걸 위해서 작성하는 게 아니니까요. 간단하게, 개발 방법론의 종류에는 시간적 순서대로 구조적 방법론 &gt; 정보 공학적 방법론 &gt; 객체지향 방법론 &gt; CBD 방법론 &gt; 애자일 방법론 이 있다고 생각하시면 됩니다. 마찬가지로 DevOps도 개발 방법론입니다. 애자일이 이름 그대로 빠르게 프로토타입을 만들고, 요구사항에 맞춰 유연하게 바꿔나가는 방식이라면 DevOps는 Agile과 유사하지만, 기존의 Agile에서 분리되어 작업하던 개발자(Dev)와 서비스 운영자(Ops)를 합친다는 의미입니다. 다시 말해, 이제 개발이 되면 바로 바로 서비스를 배포할 수 있게 된다는 의미이기도 합니다. 내가 개인 프로젝트 할 땐 내가 개발하고 끝나면 바로 배포할 수 있었는데? 설마 이런 말을 하지는 않겠지만.. 당연히 회사에서 B2B를 진행하는데 그걸 개인과 비교하지는 않을 거라고 생각합니다. 어찌보면 그게 DevOps지만, 회사에서는 그걸 적용하기가 쉽지 않았습니다. 어쨋든, DevOps는 그런 ‘문화이며 개념‘ 입니다. 이러한 DevOps에서 다루는 개발 방법은 다음과 같습니다. 협업, 커뮤니케이션을 중시 당연하다면 당연한 이야기지만, 개발자와 운영자의 협업이 없으면 서비스는 만들어 질 수가 없습니다. 두 팀이 협업을 한다고 해도, 개발팀과 인프라 운영팀이 분리되어 있으면 서로 조율을 하기가 쉽지가 않죠. 쉽게 생각하면 개발자와 운영자가 자주 대화할 수 있는 자리를 마련해야 한다는 의미이기도 합니다. CI / CD를 중시 지속적인 통합(Continuous Integrattion) 과지속적인 배포(Continuous Deploy 또는 Continuous Delivery)를 합친 말로, 이게 이루어져야 한다는 의미입니다. 다시 말해 개발, 테스트, 배포가 통합되고,자동화되어야 한다는 의미이기도 합니다. 이를 가능하게 해주는 툴은 Jenkins 등이 있습니다. 찾아보니 상품도 있었습니다. 번외) 상품 갑자기 상품이라니? 하고 생각할 수도 있겠지만, 대형 IT 기업들은 자체 DevOps 솔루션을 팔고 있습니다. 당장 인터넷에 검색만 해도 IBM, Amazon, Microsoft, Redhat, netapp, Newrelic 등등 여러 기업들이 자체 솔루션을 제공합니다. 아마 위에서 말한 협업, 지속적 통합 및 배포에 필요한 전체 도구를 패키지 상품 형식으로 제공하는 듯 합니다. 나중에 기회가 된다면 해당 솔루션을 이용해 보고 싶긴 합니다. [3] 참조 사이트 소프트웨어 개발 방법론, 위키피디아 8 Best Software Development Methodologies 데브옵스 (DevOps) 데브옵스 알아가기(1) : 애자일과 데브옵스 [개발문화탐구] 데브옵스 (DevOps) - 애자일(Agile) 애자일 방법론과 데브옵스의 유래 DevOps란 무엇일까요? DevOps란? DevOps를 하려면 무엇부터 해야 할까? [DevOps]CI/CD (지속적 통합/지속적 제공) 개념과 과정/ 툴 별 장단점 비교 [Devops] CI/CD 개념","link":"/2021/10/03/2021-10-03-004-devops/"},{"title":"이카루스 테마에 다크모드 적용하는 법","text":"(테마 다운로드) 현재 제 icarus 버젼은 4.0이고, 다크테마는 FOR ICARUS 4.1로 받은 후 적용하였습니다. 위의 주소로 들어가셔서 아래 그림에서 표시한 부분을 클릭하면,DarkMode가 추가된 icarus 테마를 받을 수 있습니다. 만약 기존에 이미 icarus 테마가 있다면 혹시 모르니 백업하시고,위 테마와 그냥 폴더 자체를 바꾸시면 됩니다.바꾸고 난 뒤, logo 이미지가 안보여지는데,위 사진과 같이 light 일때와 dark 일때 사진 경로를 따로 지정해야 보입니다.그 후 다시 Hexo 프로젝트르 배포하시고 잠시 시간이 지나야 적용이 됩니다.개인적으로 CSS는 브라우저 상에서 업데이트 시 은근 느리게 적용되는 것 같습니다.","link":"/2021/10/03/2021-10-03-002-add-dark-theme-in-icarus/"},{"title":"On Premise, Off Premise란?","text":"[1] 개요 On premise, 대충 해석하면 ~을 전제로 하다라는 뜻. 결론부터 말하면 서버를 클라우드에 설치하지 않고, 자체 보유한 전산실 서버에 설치해 운영하는 방식입니다. 다시 풀어서 말하면, 우리가 DB나, Spring과 같은 백엔드나, React와 같은 프런트엔드의 서버를 실행 할때, 실행하는 컴퓨터가 자신의 컴퓨터라면 On premise 방식으로 서버를 운영하고 있는 겁니다. 이와는 반대로 AWS, Azure, GCP등을 이용하여 우리가 만든 서비스의 서버를 실행하면 그게 Off premise가 됩니다. [2] 비교 어느정도 배우신 분들은 얼핏 보면 Off premise가 좋아보일지도 모르지만, 일반적으로 각자 장점이 있습니다. 요소 On premise Off premise 보안성 상대적으로 높음 상대적으로 낮음 인프라 구축 비용 상대적으로 높음 상대적으로 낮음 자동화된 백업 어려움 쉬움 확장 가능 어려움 쉬움 위에서 일반적 이라고 말한 이유는, 자사가 보안적으로 허술하다면,오히려 대기업이 제공하는 클라우드가 보안적으로 더 우수할지도 모르기 때문입니다. 또한 개인 프로젝트는 아무리 싼 클라우드를 구매해도 월에 10만원 전후가 나오는데,그럴 바에 자기 집 컴퓨터를 서버로 쓰는 사람도 있기 마련입니다. (아, 회사 이야긴데 옆으로 좀 샜나?) [3] 결론 위의 결론과는 다른 이야기긴 하지만, 어찌 되었든 둘 다 쓰이기는 합니다. 보안이 중요한 데이터는 On premise 환경에서, 비교적 보안성이 낮은 데이터는 Off premise 환경을 사용한다고 합니다. 실제로 요기요를 운영하는 딜러버리 코리아에서는 두개를 같이 사용한다고 되어 있습니다. 사실 조금만 생각하면 당연한 이야기지만, 이를 계속 상기시킬 목적으로 아카이브를 남깁니다. [4] 참조 사이트 온프레미스, 해시넷 [IT용어] 온프레미스, 오프프레미스 [IT정보] 온프레미스(On-premise) 개념","link":"/2021/10/03/2021-10-03-005-on-premise/"},{"title":"추천 사이트 - IT 정보","text":"[1] 개요 이 포스트는 참고할 좋은 사이트가 보일 때마다 (무지성으로) 링크를 추가할 예정입니다. 만약 해당 사이트에 관련되 IT 정보를 정리해서 따로 포스팅한다면, 체크박스에 표시를 하여 정리 완료되었다는 표시를 할 예정입니다. 또는 정리할 필요가 없어도 완료 표시로 기재합니다. [2] 목록 젠킨스 사용하여 자동 배포환경 만들어보기 딜리버리 히어로 코리아 채용 사이트 Delivery Tech Korea 요기요 기술 블로그 gather.town 소개 및 사용법 - 우왕 가상오피스다!!! Prometheus란? [구글검색] GraphQL이란 구글 서치 콘솔 사이트맵 등록 오류, URL 색인 요청 해보기 hexo 시작하기 모던 JavaScript 튜토리얼 [Spring Boot] CORS 설정하기 개발자라면 꼭 알아야할 Hash Table 의 모든 것! HEXO 이미지 삽입(이미지 중앙 정렬 방법 포함) 쿠키와 세션 그리고 로컬 스토리지와 세션 스토리지 [JS] Prototype : 프로토타입 쉽게 이해하기 [Context Switching] 프로세스와 쓰레드에서의 컨텍스트 스위칭 OS,배치,시분할, 멀티프로그래밍, 멀티태스킹 스케줄링 (배치 처리, 시분할 시스템, 멀티 태스킹, 멀티 프로그래밍) 컴퓨터공학 Operatiob System 역사 각종 소스 참고 블로그 각종 기술 공부 로드맵 (강추) The Twelve-Factor App (한국어 버전) (강추)","link":"/2021/10/03/2021-10-03-006-recommend-url/"},{"title":"지극히 개인적인 생각","text":"보는 관점에 따라 민감한 내용이 담겨 있습니다. 개발자가 너무 많다 최근 유튜브 추천 영상으로 비전공으로 IT회사에 취업한 사람들의 Vlog나,그런 분들의 지식 공유 영상이 뜨면서 꽤 많이 보게 되었는데,우선 대부분의 비전공자 분들은 저와 같이 웹쪽으로 취업을 하신 것 같아 보였습니다.사실 웹이 입문하기엔 가장 쉽다고도 하고, 실제로도 다른 소프트웨어 엔지니어 대비 자신이 만든 결과물을 빠르게 볼 수 있기도 해서 흥미를 붙이기에는 좋은 분야인 듯 합니다. 하지만 입문이 쉽다는 거지, 입문 후 배워야 할 내용은 다른 분야랑 차이가 없습니다. 심하면 다른 IT분야보다 더 배워야 합니다. 그럼에도 불구하고 유튜브에 영상을 올리시는 중소기업에 취직하신 비전공자 분들이 올리신 영상 중, 꽤 많은 영상들이 단지 회사 생활에서 기존의 자신이 배웠던 것만 쓰고 마는, 어찌보면 기계적인 일처리를 하고 있는 것 같아 보였습니다. 몇몇 사람들은 IT에서 일하는 사람들을 이렇게 나누기도 합니다. 그냥 컴퓨터 언어(=코드)를 사용할 줄 아는 코더와,프로그램을 위해 코드를 사용하는 프로그래머와,실제 소프트웨어를 만드는 디벨로퍼, 즉 개발자가 있다. 보통은 코더, 프로그래머 혹은 코더, 개발자 이렇게 2가지 종류로 나눈다. 그리고 인터넷에서는 ‘비전공자 국비지원은 코더로 양산된다‘ 라고도 합니다. 얼추 맞는 이야기이긴 합니다. 저도 비전공자이고, 실제로 코더가 된 사람들도 경험했습니다. 심지어는 단기간으로 웹을 배운 비전공자 출신들이 은어적으로 ‘웹싸개‘ 라고 불리기도 합니다. 사실 저도 할 말은 없습니다. 저도 지금은 웹싸개나 다름 없는 신세라고 생각하거든요. 그렇기 때문에 끊임없이 새로운 기술을 익히고, 더더욱 폭 넓은 정보를 익혀야 한다고 생각합니다. 우리와 같은 비전공자 노베이스를 취직 시켜준 회사도 바보가 아닌 이상, 취직에는 이유가 있습니다. 자신이 만약 국비 지원을 다니는데, 국비 지원에서의 취업 연계로 취업하였다면취업을 댓가로 학교와 학원이 이득을 보는 구조이고, 스스로 찾아서 취업을 하였다 하여도, 자신의 실력이 취업할 실력이 아님에도 되었다면,그 회사는 단지 ‘웹싸개‘를 원하는 곳일 뿐입니다. 비전공자들은 대부분은 규모 있는 IT기업에는 취업하지 못합니다. 이전에 모 대기업 게임회사의 AI부서에서 아르바이트를 한 적이 있었는데,해당 부서의 모든 직원분들은 전공자에, 심지어 대부분이 이쪽 분야의 대학원을 졸업하신 분들이었습니다.이는 웹쪽도 마찬가지였습니다. 비전공자가 입사하기 위해 시도 할 수 있는 방법으로는 ‘경력직으로 입사‘ 밖에는 없는 셈입니다. 물론 그것도 경력을 채울 때까지 꾸준히 폭 넓고, 깊은 공부를 해야 가능한 이야기죠. 제가 제 자신을 포함해서 비전공자 분들에게 말씀드리고 싶은 것은 딱 하나입니다. 취미를 적는 란에 개발이라고 쓸 정도의 마인드를 가지세요. 코딩이 아니라 개발이요. 물론 코딩도 중요하지만, 코딩만 한다면 그건 코드 몽키와 다를 게 없다고 생각합니다. 끊임 없이 새로운 기술을 익히고, 전체적인 개발 프로세스에 대한 공부를 취미로 둘 정도가 되어야 한다는 것입니다. 개발자는 카페에서 여유롭게 노트북 켜놓고 코딩하는, 비전공자가 보기엔 멋있을 수도 있는 모습은 진정 개발자의 모습이 아닙니다. 특히 4년, 혹은 그 이상의 시간을 IT공부를 한 전공자에 비해 1년도 안되는 기간에 배운 지식은 턱 없이 부족합니다. 정말 부족해요. 배우는 기관에 따라 다르지만 제가 배운 기관 기준으로 말씀드리면, Java를 배웠고, Spring을 배웠고, 게시판 CRUD 구현하였고, 정보처리기사 자격증 강의도 들어, 총 7개월 정도 교육을 들었습니다. 조금 더 붙이면 RDBMS사용법도 좀 배우고, 웹에서는 JS, JS의 라이브러리들을 배웠습니다. 배우는 7개월 동안, 그것도 많다고 느껴졌는데, 막상 회사를 들어가니 그게 아니었습니다. 서버에 대한 지식을 익히기 위해 리눅스를 배워야 했고, 협업을 하기 위해 여러 협업 툴을 다루는 법을 익혀야 했고, 테스트 주도 개발을 위해 테스트에 대한 전반적이면서 심도있는 지식을 익혀야 했고, 프론트엔드 프레임워크 및 라이브러리의 넘쳐나는 최신 기술들을 익혀야 했고, 다른 언어 기반의 프레임워크로 생성한 백엔드의 구조도 알아야 했습니다. 심지어 저는 일본 회사이기에 사양서는 수십, 수백개가 넘는 문서는 일본어로 되어 있습니다. 그리고 위의 배워야 하는 기술 및 개념은 아직 현재 진행형으로 추가되고 있습니다. 그렇기 때문에 이 블로그에서 간략하게 제가 배운 지식을 기록으로 남기고자 하려는 것입니다. 약간 다른 이야기지만, 아는 분 중 어떤 개발자 분이 이런 말씀을 하셨습니다. 개발자는 항상 더 나은 코드를 생각해야 한다. 사실 이것도 다들 아는 말입니다. 클린 코드를 지향해야 한다는 건 웬만큼 배운 분들이면 다들 압니다. 그렇지만 실천하기엔 힘들죠. 그럼에도 해야 합니다. 그렇게 해야 이 업계에서 살아남는다고 생각합니다. 개발자는 끊임없이 고민하고, 공부해야한다는 의미입니다. 다시 유튜브의 이야기로 돌아오자면, 비전공자분들께서 나름대로 열심히 노력하셔서 취업하시고, 자신들의 일상을 단지 보여주는 영상에서, 일적인 부분은 컨텐츠적인 요소이다. 라고 보면 사실 이렇게까지 길게 쓸 필요는 없긴 합니다. 다만, 영상만 봤을 때는 그저 코더의 모습만 보이는 듯 하여 이렇게 포스팅을 하게 되었습니다. 만약, 개발이 자신에게 맞지 않다면 과감하게 다른 길로 가는 게 좋다고 생각합니다. 마지막으로 영상 하나 첨부하고, 오늘의 아카이브는 이것으로 마치도록 하겠습니다. 개발이라는 것에 대해 한 번 제대로 생각하는 계기가 되었으면 하는 바람입니다.","link":"/2021/10/03/2021-10-03-007-memo/"},{"title":"타입스크립트 컴파일 및 실행","text":"[1] 개요 문득, 자바스크립트와 타입스크립트로 짠 프런트엔드 프로젝트를 보면서 문득 생각이 들었습니다. 아니 생각해보니 자바스크립트랑 타입스크립트 파일을 로컬에서 어떻게 실행하지? 문득 생각이 드니 정말 창피한 일이 아닐 수가 없습니다. 언어를 사용하면서 웹을 만드는 사람이 언어 자체 실행 방법은 모른다니.. 원의 넓이를 구하는 공식은 아는데 정작 곱셈이라는 게 뭔지도 모르는 꼴입니다. 당장 찾아봤습니다. Nodejs가 컴파일러의 역할을 하는 듯 합니다. [2] 방법1 당연하지만, Nodejs, Typescript(전역 설치)가 설치되어 있어야 합니다.Typescript 는 터미널에서 npm i typescript -g 로 설치합니다. 아무대나 ts 파일을 생성합니다. 저는 hello.ts 라고 하겠습니다. 그리고 vscode에서 해당 파일의 경로로 가서 파일을 열고 코드를 추가합니다. hello.ts12let hello: string = &quot;hello world&quot;;console.log(hello); 그 후 해당 hello.ts 파일이 있는 위치에서 터미널을 열고, 아래와 같이 ts 파일을 자바스크립트로 컴파일(번역) 합니다. Terminal(cmd)1C:\\Users&gt;tsc hello.ts 그러면 다음와 같이 js 파일이 생성됩니다. 어쨋든 js 파일이 생성되었으면 이제 node로 실행합니다. Terminal(cmd)1C:\\Users&gt;node hello.js 그럼 아래와 같이 뜹니다. C:\\Users&gt;node hello.js hello world [3] 방법2 헌데, 위의 방법은 컴파일 후 실행이라는 귀찮음이 있습니다. 따라서 ts 파일에서 바로 실행해주는 ts-node 패키지를 지역으로 설치하여, 이것을 컴파일러로 씁니다. 그리고 폴더 하나 만든 후에 터미널에 아래의 코드를 입력합니다. Terminal(cmd)12C:\\Users\\test&gt;npm i ts-nodeC:\\Users\\test&gt;tsc --init tsc –init은 ts-node를 실행하기 위함입니다. 설치 완료 후 위와 같이 폴더내에 hello.ts를 만들고 아래의 코드를 입력합니다. Terminal(cmd)12C:\\Users\\test&gt;npx ts-node hello.tshello world [4] 여담 만약 간단한 Javascript를 실행하고자 한다면, 그냥 브라우저 개발자도구로 실행하시면 됩니다. 크롬이라면 F12 눌러서 나오는 개발자 도구 창에서 콘솔을 들어가시면 그게 편집기입니다. 파이어폭스도 동일합니다 나머지 브라우저는 비슷한 곳에 있거나, 없다면 찾아보시길 권합니다. [5] 참조 사이트 JS Compile과 Build [typescript] 1. 설치 [ typescript ] ts-node를 사용하여 ts를 js로 컴파일 하기전에 터미널에서 출력해보는 방법. 자바스크립트로 컴파일러 만들기","link":"/2021/10/04/2021-10-04-001-how-to-compile-typescript/"},{"title":"자바스크립트 동작 원리","text":"[1] 개요 제목 그대로 브라우저상에서 Javascript의 동작 원리를 알아보고자 합니다. 고작 국비지원으로 JS 배운 저에게는 웹의 영역은, 넓고 넓은 바다같은 존재이므로 제가 가지고 있는 지식으로 간략하게 이해를 하고, 이걸 써먹을 수 있을 정도로만 기록하고자 합니다. [2] 작동원리 직관적이고, 간단하게 요약하자면 아래와 같습니다. 개발자가 JS코드를 작성 이를 HTML에 삽입한 후 HTML을 실행 (파일 자체를 열든, 웹 서버로 실행하든) 브라우저는 우리가 짠 HTML, CSS, JS 코드를 파싱, 즉 가져옴 (지금은 JS만 소개) 가져온 JS 브라우저 설치 시 내장된 JS 가상머신이라는 엔진으로 이를 해석하고 실행함. (오늘 설명할 단계) 여러 변환 및 렌더링을 통해 완성된 결과를 브라우저 화면에 나타냄 [3] 자바스크립트 엔진(JavaScript Engine) 이걸 왜 알아야 해? 굳이, 굳이 따지면 알 필요는 없습니다. 실제로 몰라도 웹 개발은 할 수 있습니다. 그래도 알면 도움은 됩니다. 그러니, 간략하게 적도록 합니다. 다시 설명드리자면, 자바스크립트 엔진(이하 JS엔진)은 개발자가 작성한 JS 코드를 해석하고 실행하는 프로그램이자 인터프리터. JS가 인터프리터 언어이기에 엔진을 인터프리터라고도 합니다. 그런데 이 JS엔진은 브라우저 종류마다 다르고, 또 브라우저가 아닌 것들(Node.js)에서도 동작하는데 각 실행 환경마다 다른 엔진을 가지고 있습니다. 엔진의 명칭 및 종류로는 V8 : 구글에서 만든 오픈소스 엔진. C++ 기반이며, Node.js와 크롬에서 사용SpiderMonkey : 최초의 JS엔진. 파이어 폭스에서 사용됨.Chakra : 인터넷 익스플로러에서 사용됨.JavaScript Core(JSC) : 애플에서 개발. Safari와 React Native App에서 사용됨. 그 외 여러가지 버전이 있지만 그 중 많이 쓰이는 환경의 엔진을 나열하자면 그렇습니다. [4] 엔진 동작 원리 우선, 엔진에는 뭐가 있는지 보자면 아래와 같이 두가지가 있습니다. Memory Heap(통칭 Heap) : 메모리 할당이 일어나는 곳. 쉽게 말해 변수나 함수를 작성하면 이곳에서 저장됨.Call Stack(통칭 Stack) : 호출한 함수나 변수를 실행시켜주는 곳. 한군데만 존재 JS가 싱글 스레드(스택들이 쌓이는 곳)라고 불리는데, 위에서 설명했다시피 Call Stack이라는 스레드가 1개이기 때문입니다. 그리고 전혀 다른 이야기이지만, JS는 Java와 마찬가지로 가비지컬렉터가 있으므로 자동으로 메모리 누수를 방지합니다. 물론 예외는 있습니다. 그렇다면, 위의 두가지 요소가 서로 상호작용하면서 JS를 실행하는 방식은 다음과 같습니다. Stack이라는 곳에서는 선입후출 방식으로 코드가 하나씩 들어가고 나오는데, setTimeout같은 함수나, Ajax의 XMLHttpRequest같은 Web API는 JS 엔진 밖에서 실행되므로, 바로 실행되지 않고 일단 Stack에서 빠집니다. Web API는 특정 요청에 대한 응답시간을 갖고, 특정 요청의 응답이 완료되면 Task Queue(= Callback Queue) 라는 대기실에서 잠시 머문 뒤, Event Loop라는 놈이 Call Stack이 모두 비워지면 큐에 있는 응답(콜백)들을 들어온 순서대로(선입선출) Stack 으로 보내주는 역할을 하고, 다시 Stack에서는 이를 처리합니다. 아래의 그림은 지금까지 말한 순서를 그림으로 표현한 것입니다. 이때, 0초 혹은 0초에 가깝게 응답하는 Web API의 경우에도 무조건 비동기식으로 처리되는 점은 주의해야 합니다. 쉽게 말해 setTimeout같은 비동기 함수 쓰면 무조건 동기적인 처리를 하는 JS함수들 보다 뒤에 출력됩니다. 이를 달리 말하면, 동기적인 처리를 하는 JavaScript에서 엄청 시간이 들여지는 For문을 쓰면 스택에서 계속 돌아가게 되는데, 스택은 1개이기에 그 For문이 끝나기 전까지 뒤에 있는 다른 작업들은 하지 못합니다. 이를 블로킹(blocking)이라고 합니다. 그래서 비동기 함수가 필요한 것입니다. 참고로 동기 함수에서 비동기 함수로 만드는 방법은 async, await를 사용하면 됩니다. 아래의 주소는 자바스크립트 동작 방식을 눈으로 확인하며 시험해보는 사이트입니다. http://latentflip.com/loupe [5] 참고 사이트 자바스크립트 엔진이란? 자바스크립트 엔진 [JS] 브라우저 작동 원리 JavaScript, 인터프리터 언어일까? 브라우저는 어떻게 동작하는가 자바스크립트 엔진(위키피디아) How does JavaScript Work? fetch, setTimeout은 표준 API일까? 개발자 90%가 모르는 자바스크립트 동작원리 (Stack, Queue, event loop) (강추) 2) 자바스크립트 작동원리 (실행 컨텍스트, 싱글스레드, 비동기) (강추)","link":"/2021/10/09/2021-10-09-001-how-does-javascript-work-in-browser/"},{"title":"스프링부트 CORS 정책 허용 설정 방법","text":"[1] 개요 제목에 썼다시피 CORS, 즉 기본적으로 브라우저 상에서 차단하고 있는교차 출처 리소스 공유 정책에 대한 허용을 Spring에서 허용하는 방법을 작성하고자 합니다. 그 전에 한 마디 하고 싶은 게 있는데, 꼭, 맨 아래 단원의 참조 포스트 1, 2번을 보시길 강력하게 추천합니다. [2] 방법 방법이라고 해 봤자 간단합니다. 프로젝트에서, 어디 각종 설정파일들을 두는 패키지 하나 만들고그곳에 cors를 허용하는 설정을 코드로 입력하면 됩니다. 보통은 config 라는 이름의 패키지를 만들어서 두긴 합니다. 스프링뿐만 아니라, 다른 Nodejs의 Express, Python의 Django도 모두 동일한 원리입니다.백엔드에서 이를 허용해주어야 해당 API를 가져올 수 있습니다. 백문이 불여일견이라고, 아래처럼 config 패키지(=폴더)를 만듭니다. 그리고 config 패키지에 자기가 원하는 이름의 클래스를 만들어 줍니다. 저는 WebConfig 라고 하겠습니다. WebConfig.java123456789101112131415package 내_패키지_경로.config;import org.springframework.context.annotation.Configuration;import org.springframework.web.servlet.config.annotation.CorsRegistry;import org.springframework.web.servlet.config.annotation.WebMvcConfigurer;@Configurationpublic class WebConfig implements WebMvcConfigurer { @Override public void addCorsMappings(CorsRegistry registry) { registry.addMapping(&quot;/**&quot;) .allowedOrigins(&quot;해당 API를 요청하는 쪽의 url&quot;); }} 위에 .allowedOrigins() 함수 내 url은 주로 프런트엔드 서버의 요청이 들어올 것입니다. 예를 들어, 자기 로컬 환경에서 만든 React의 경우엔 http://localhost:3000가 프로젝트 root url이 될 것입니다. 그러면 .allowedOrigins(“http://localhost:3000&quot;) 와 같이 쓰면, 해당 url 을 베이스로 사용하는 모든 url에서 우리가 만든 백엔드의 API를 사용할 수 있게 됩니다. [3] 결론 위에서 쓴 대로 그냥 패키지 하나 만들고,파일 하나 만들고,짤막한 코드 몇 줄 적으면 끝입니다. 개인적으로 국비 지원 때 팀 프로젝트 할 때 이것 때문에 꽤나 고생했는데, 방법은 간단했습니다. 위에서 적은 방법은 (1) 서버쪽에서 특정 프론트엔드에 CORS 정책 허용하는 방법입니다. 서버에서 서버로 통신 시에는, 다시 말해, (2) 서버인 백엔드에서 다른 서버의 API를 가져올 때는 CORS가 적용되지 않습니다. 그럼, (3) 프론트엔드에서 외부 서버로 CORS 정책 허용을 요청하게 해야 할 때는 어떻게 하나요? 찾아보니 방법은 꽤 있었습니다. 타인의 프록시 서버를 이용하여 서버 &gt; 서버 통신인 것 처럼 보이게 하기 직접 프록시 서버를 구축하여 1번처럼 사용(단, 서버에서 설정도 해주어야 하는 것 같음) 로컬 환경에서 서버, 클라이언트 모두 실행하였다면 프론트엔드에서 http-proxy-middleware 사용 서버에서 CORS 정책을 허용하기 (제가 본 게시글에서 사용한 방법입니다) 서버에서 CORS 미들웨어 설정하기(Express.js 처럼 미들웨어를 사용하는 서버인 경우) 등이 있다고 합니다. 모두 시도는 해보지 않았지만, 참조 사이트에 링크를 남기겠습니다. 개인적으로 프론트엔드에서 외부 백엔드에 Http 요청을 보낼 때 CORS 허용하는 방법은 없다고 생각해왔고,국비 지원때도 온갖 방법으로 프론트에서 시도하였지만 실패했었고,프론트에서 가능하다고 말하는 분들을 모두 부정해왔는데, 위에 쓴 대로 된다면 방법이야 있는 것 같습니다. 오늘 한 번 프록시를 이용한 요청을 시도해보려고 합니다. [4] 참조 사이트 [Browser] CORS란? (추천1) CORS 😫 (추천2) CSRF, CORS 개념 CORS는 왜 이렇게 우리를 힘들게 하는걸까? 나를 너무나 힘들게 했던 CORS DPFJ 해결하기","link":"/2021/10/04/2021-10-04-002-allow-cors-issue-in-springboot/"},{"title":"추천 영상 [2] - React 입문자들이 알아야할 Redux 쉽게설명 (8분컷)","text":"저와 같이 Redux가 뭔지도 모르는 사람들에게 쉽게 개념을 설명해주는 좋은 강의라고 생각합니다. 자세히 공부하면 어려워지는 건 모든 개념이나 기술은 다 그렇기에, 지금은 단순히 쓰는 이유에 대해서만 알아도 충분하다는 생각이 듭니다. 회사에서는 Angular를 쓰기에, 아주 조금 배운것 마저 다 잊어버렸긴 한데.. 책도 있으니 시간에 여유가 생기면 다시 공부하고자 합니다. P.S. 위에서 설명해주신 유튜버분의 다른 영상들도 재밌고 쉽게 가르치는 느낌이니, 다른 영상들도 보시길 추천드립니다.","link":"/2021/10/09/2021-10-09-002-describe-redux/"},{"title":"Vue3 설치 시 vscode Vetur Extension 오류 일시적인 해결법","text":"[1] 개요 역시 작심 3일인가 봅니다. 오랜만의 포스팅입니다. 그럼에도 불구하고 오늘은 간단한 포스팅을 하고자 합니다. 주제넘게, 회사에서 쓰이는 Angular 도 제대로 알지도 못하는 주제에 Vue를 조금 공부해보고자 설치하였습니다. 사실 여기에서 제 얘기를 길게 말해봤자 해결법을 보러 오신 분들은 관심 없을테니 본론으로 들어갑니다. [2] 현상 미리 말해두겠지만, 경고창을 닫는 방법이지, 완전한 해결법은 아니라고 생각합니다.어디에서는 Vuter 공식 FAQ를 보라고 하지만 저는 해결이 안되었습니다 일단 오류는 다음과 같습니다. Vetur can’t find ‘package.json’ in /xxxx/xxxxxx.Vetur can’t find tsconfig.json, jsconfig.json in /xxxx/xxxxxx.The template root requires exactly one element.eslint-plugin-vue 경고2개, 문법 오류1개입니다. 자료를 찾아보고, 인터넷에 쓰여져있는 여러가지의 해결 방법을 해봤으나, 결국엔 그냥 껐습니다. [3] 해결 vscode에서 F1 누르고 Preferences: Open Settings (JSON) 를 입력합니다. 그 후 나오는 json 파일에서 아래의 두 줄을 입력합니다. setting.json123456{ ... &quot;vetur.validation.template&quot;: false, &quot;vetur.ignoreProjectWarning&quot;: true, ...} 위 코드들을 번역만 해도 알겠지만, 간단하게 설명하자면 위는 문법 유효성 검사 자체를 해제하는 코드이고, 아래는 Vetur can’t find … 에 대한 경고를 해제하는 코드입니다. (사실 Vetur만 삭제하면 끝날 일인데) 그런데 이 글을 작성하면서 조금 더 찾아보니 위의 줄에 대한 해결 방법이 있긴 했습니다. “vetur.ignoreProjectWarning”: true 처음 App.vue에는 App.vue1234&lt;template&gt; &lt;img alt=&quot;Vue logo&quot; src=&quot;./assets/logo.png&quot;&gt; &lt;HelloWorld msg=&quot;Welcome to Your Vue.js App&quot;/&gt;&lt;/template&gt; 이런 식으로 작성되어 있을 텐데, 이것을 App.vue123456&lt;template&gt; &lt;div&gt; &lt;img alt=&quot;Vue logo&quot; src=&quot;./assets/logo.png&quot;&gt; &lt;HelloWorld msg=&quot;Welcome to Your Vue.js App&quot;/&gt; &lt;/div&gt;&lt;/template&gt; 이런 식으로 하나의 template 태그 아래, 하나의 div 태그로 또 감싸고, 그 안에 모든 html을 작성하면 됩니다. [4] 결론 벌써부터 공부하기 두려운 프레임워크입니다 아니 시작하기도 전부터 터지는 오류, 경고에 Vue에서 많이 쓰인다는 UI 프레임워크인 Vuetify도 Vue3는 지원 안한다고 해서, 결국 구글링의 연속입니다. 최신화된 강의도 별로 없고, 이거 배울려면 돈을 쓰던가 아니면 삽질을 하던가 해야겠습니다. [5] 참고 사이트 Vetur 공식 FAQ Vue 3 The template root requires exactly one element.eslint-plugin-vue multiple root 생성으로인한 에러 [vue]Vetur 플러그인 관련 오류 (저는 이걸로 해결 안됐습니다)","link":"/2021/10/18/2021-10-18-001-vue3-start-error/"},{"title":"쿠키, 웹 스토리지 사용법(JavaScript)","text":"[1] 개요 사실 카테고리를 어디에 둘까 매우 고민했습니다. IT 정보로 두려고 했는데, 사용법이 주 가 되려면 자바스크립트 코드는 필수니, 고민 끝에 언어 카테고리에 적고, 쿠키, 웹 스토리지가 뭔지 간략하게 설명하려고 합니다. [2] 설명 우선 대부분 크롬, 파이어폭스, 엣지와 같은 대중적인 브라우저를 사용한다는 가정하에 설명드립니다.저는 크롬을 사용하겠습니다. F12를 누르면 개발자 도구가 나오는데, 여기에서 응용프로그램(Application)탭을 클릭합니다. 그리고 왼쪽 사이드바에서 쿠키, 세션 스토리지, 로컬 스토리지가 나옵니다. 이번 포스트에서는 위의 화면에서 로컬 스토리지, 세션 스토리지, 쿠키를 다룰 예정입니다. IndexedDB, 웹 SQL등은 사용자의 브라우저에 저장하는 DB API정도로 이해하면 됩니다. 어쨋든 위의 3개 저장소를 특정 사이트에서 각각 눌러보면 어떤 목록이 나오거나 안나오기도 합니다. 그래서 여길 왜 들어가야 하는데? 지금부터 사용할 코드들이 위 3개 저장소에서 저장되기 때문입니다. 쿠키 우리가 방문한 웹 사이트의 정보를 클라이언트(우리의 브라우저)에 저장하는 파일입니다. 따라서 브라우저를 닫고 다시 켜도 만료 일자가 남아 있으면 사이트를 들어가도 이전에 설정한 정보 그대로로 보여줍니다. 쿠키는 특정 사이트 내 최대 저장 갯수가 제한되어 있고, 만료 일자를 정해야 합니다. 예시) 특정 사이트에서 나오는 하루 동안 보지 않기 팝업창 웹 스토리지 - 세션 (HTML5 이상부터 지원) 우리가 방문한 웹 사이트의 정보를 클라이언트(우리의 브라우저)에 저장하는 파일입니다. 다만, 쿠키와는 다르게 브라우저를 닫으면 저장된 정보가 다 없어집니다. 예시) 특정 입력 페이지(회원가입 페이지), 일회성 로그인 페이지, 비로그인 장바구니 페이지 웹 스토리지 - 로컬 (HTML5 이상부터 지원) 우리가 방문한 웹 사이트의 정보를 클라이언트(우리의 브라우저)에 저장하는 파일입니다. 이 정보는 따로 삭제하지 않는 이상 브라우저를 닫아도 영구적으로 남아있습니다. 예시) 자동 로그인, 특정 사이트 다크모드 등 (제 블로그에서 사용 중입니다) 그 외 보안성이라던가, 데이터 용량관련 설명도 있는데, 사용법을 남기려고 했지, 그런건 필요가 없다고 생각이 듭니다. [3] 구현 Local Storage 1-1. web-storage 라는 폴더에 index.html과 가져올 js파일인 reference.js를 만듭니다(= 프로젝트 생성) 1-2. 그리고 이를 vscode 확장팩인 Live Server로 구동시켜봅니다(오프라인에서 직접 열어도 가능) 1-3. reference.js에서 Local Storage를 생성합니다. reference.js1234(function () { var value = &quot;영구 저장 값&quot;; localStorage.setItem(&quot;local&quot;, value);})(); 1-4. 위의 값을 저장 하면 Live Server가 재시작 되므로 바로 콘솔창을 확인할 수 있습니다. 위의 값은 브라우저를 닫고 다시 켜도 같은 주소 (위에서는 http://127.0.0.1:5500/)면 영구적으로 남게 됩니다. 물론 삭제도 가능합니다. 콘솔창에서 키 / 값 쪽 영역에서 마우스 우클릭하고 삭제 버튼을 누르면 삭제가 됩니다. Session Storage 2-1. Local Storage와 구현 방식은 동일합니다. JS코드만 바꿔주도록 합니다. reference.js1234(function () { var value = &quot;브라우저 끄면 사라지는 값&quot;; sessionStorage.setItem(&quot;session&quot;, value);})(); 2-2. 위의 값은 브라우저를 닫으면 사라지게 됩니다. (지금은 즉시 실행 함수에 의해 무조건 다시 생김) Cookie 3-1. document.cookie 라는 JS 내장 기능을 이용합니다. reference.js123(function () { document.cookie = &quot;name=value; max-age=3600;&quot;;})(); 3-2. 그럼 콘솔에서는 아래와 같이 나옵니다. 3-3. 위에 필드명에 쓰여진 대로 domain, path, expire / max-age.. 여러가지 정보를 직접 설정 할 수 있습니다. 위 코드 같은 경우엔 쿠키의 유효시간을 1시간(max-age=3600)으로 주었습니다. 자세한건 모던 JavScript 튜토리얼 쿠키편 을 참고하시면 됩니다. [4] 결론 예시 사용법에 나와있는 대로 쓰임새를 생각하여, 골라서 쓰시면 됩니다. 다시 말씀드리면, 세션 스토리지는 정보의 1회성 저장에 용이하며, 로컬 스토리지는 정보의 영구 저장에 용이하고, 쿠키는 정보의 특정 기간동안 저장에 용이합니다. 그 외에 세션이라는, 서버(백엔드) 메모리에 저장되는 데이터도 있지만, 여기서는 다루지 않겠습니다.※ 세션은 세션 스토리지와 다른 개념입니다. (영문 참고) [5] 참고 사이트 로컬스토리지, 세션스토리지, 쿠키 정리 [JavaScript]로컬스토리지, 세션스토리지, 쿠키 정리 [TIL] Cookie vs LocalStorage vs SessionStorage [자바스크립트] 웹 스토리지 (localStorage, sessionStorage) 사용법 쿠키, 웹 스토리지 (로컬 스토리지, 세션 스토리지)","link":"/2021/10/09/2021-10-09-003-web-storage/"},{"title":"Amazon CodeWhisperer 프리뷰 사용법 및 후기","text":"[1] 개요 오랜만에 포스팅 합니다. 이전 포스팅 날짜를 보니 거의 10개월 만의 포스팅이네요. 요즘 회사에서는 한창 AWS를 사용하는 프로젝트 중이라, 저도 많이 배우고 있습니다. 다만, 코딩의 비중이 매우 낮아 사실상 개인적으로 프로그래밍을 하지 않으면 안될 정도네요. 그런 의미에서 취미로 뭔가 만들려고 하던 중, AWS에서도 AI기반 코드 제안 서비스가 있다고 들어서 이를 사용하고자 하였습니다. 저는 GitHub Copilot를 사용해 본 적이 없어서 둘을 비교해 볼 수는 없기에 CodeWhisperer 에 대한 이야기만 하고자 합니다. [2] Amazon CodeWhisperer 신청 우선 CodeWhisperer에 대한 사용 신청을 먼저 해야 합니다. 현재 CodeWhisperer는 프리뷰 상태이므로 여기에서 신청하시면 됩니다. 신청 후, 며칠이 지나면(본인 기준 1주일 소요) 엑세스 코드가 들어있는 메일이 옵니다. 또한 메일에는 VSCode, JetBrains 에디터등 IDE에서 사용방법에 대한 링크도 있으므로 들어가셔서 적용하시면 됩니다.참고로 저는 VSCode에서 사용중입니다. [3] 사용 사용법은 매우 간단합니다. 각 언어에 맞게 만들고 싶은 소스를 설명하는 주석을 적고 tab을 누른 뒤 잠시 기다리거나, 함수를 정의하면 됩니다. 예를 들어 두개의 숫자를 합하는 함수를 만든다고 가정했을 때, 위 그림과 같이 간단한 함수는 주석만 적어도 바로 나옵니다. 또한 방향키 (←,→)로 다른 코드를 제안받을 수도 있습니다. 그리고 AWS에서 만든 서비스 답게, AWS 서비스 생성도 가능합니다 가장 유용하다고 느낀 부분은, Lambda 함수 작성 시, api 호출 템플릿을 빠르게 만들 수 있다는 점이었습니다. 물론 문법적으로 수정할 부분이 있기야 하지만, 예시 템플릿 하나를 바로 만들어 주니, 확실히 반복 작업이 줄어드는 장점이 있습니다. TMI로, 일본어 주석도 대응한다고 합니다 [4] 결론 솔직히 매우 편리하긴 합니다.프리뷰이고, 따로 신청을 해야 함에도 불구하고 이 정도 퀄리티라면 정식 출시가 기다려지네요. [5] 참고 사이트 [공식]Working with CodeWhisperer in VS Code 【プレビュー】Amazon CodeWhisperer で爆速コーディングしてみた","link":"/2022/09/28/2022-09-28-001-aws-code-whisperer/"},{"title":"[20211204 기준] Vue3 + Tailwind CSS 프로젝트 생성법","text":"[1] 개요 이번에도 오랜만의 포스팅입니다. 회사 일로 바빠서 쓸 시간이 없었지만,왜 공백이 길었는지 궁금하신 분들은 어차피 없을테니 바로 글 작성하도록 하겠습니다. [2] Vue3 설치 (참고) Vue.js 와 Vue 같은 의미입니다. 즉, Vue.js = Vue2 or Vue3입니다.왜 당연한 것 같은 이야기를 하냐면, Angular는 AngularJS 와 다릅니다. 사전 설치 준비물 Nodejs (2021-12-04 기준 16.13.1 *LTS 버전 설치) LTS : 장기 지원 버전의 약자로, 안정된 버전 중 가장 최신 버전을 의미 Nodejs는 무조건 LTS 버전으로 받아야 합니다. (여기 참조) vscode (Vue 개발용 IDE, 아래는 추천 확장 프로그램) Vetur : Vue.js 코드 문법 강조, 디버깅, Linting 지원 Vue 3 Snippets : Vue 컴포넌트 작성 시 자동완성 지원 Vue Peek : 컴포넌트 추적 가능 ESLint : 코드 문법 검사기(Vue, React, Angular 모두 사용) Vue3 설치 및 프로젝트 생성 2-1. Vue CLI 설치 Vue CLI 는 말 그대로 Vue를 CLI(터미널 창)에서 개발하기 위한 도구입니다. 터미널 창에서 아래의 명령어를 입력합니다. Terminal1npm install -g @vue/cli (만일, Vue2를 설치하려면 이 게시글을 참고해주세요) 2-2. Vue3 프로젝트 생성 터미널 창에서 아래의 명령어를 입력합니다. Terminal1vue create 프로젝트명 그러면 아래와 같은 선택지가 나오는데, Vue3를 선택하면 됩니다. 프로젝트 설치가 완료된 후, 프로젝트가 잘 실행되는지 테스트합니다. Terminal1~\\프로젝트명&gt; npm run serve 잘 실행이 된다면 다음으로 CSS 프레임워크인 Tailwind CSS를 설치합니다 (선택) Tailwind CSS 설치 3-1. Tailwind CSS 설치 터미널 창에서 아래의 명령어를 입력합니다. Terminal1npm install -D tailwindcss@latest postcss@latest autoprefixer@latest 위의 Tailwind CSS를 설치하면 2021-12-04 기준, Tailwind CSS 적용 후 npm run serve 시 아래와 같은 오류가 발생합니다. Error: PostCSS plugin tailwindcss requires PostCSS 8. 쉽게 말해서, Tailwind CSS에서는 PostCSS라는 플러그인의 8버전을 아직 지원안한다는 의미입니다. 따라서 PostCSS8 버전을 삭제하고 PostCSS7 버전을 설치합니다 Terminal12npm uninstall tailwindcss postcss autoprefixernpm install -D tailwindcss@npm:@tailwindcss/postcss7-compat @tailwindcss/postcss7-compat postcss@^7 autoprefixer@^9 되도록 최신 버전을 쓰는 게 좋다고 생각하기에 일단 8버전 설치를 먼저 시도합니다. 3-2. postcss.config.js 와 tailwind.config.js 파일 생성 터미널 창에서 아래의 명령어를 입력합니다. Terminal1npx tailwindcss init -p 그 후 배포 시 프로젝트 경량화를 위해 필요한 css만 추출하도록 tailwind.config.js내 purge 옵션에 대상 파일을 추가합니다. tailwind.config.js1234567891011module.exports = {purge: ['./index.html', './src/**/*.{vue,js,ts,jsx,tsx}'], // 이 부분만 변경darkMode: false, // or 'media' or 'class'theme: { extend: {},},variants: { extend: {},},plugins: [],} 3-3. app.css 생성 후 Tailwind CSS 적용 기존의 CSS 대신 Tailwind CSS를 적용 할 수 있게 src 폴더 내 styles라는 폴더 생성 후, 그 안에 app.css라는 파일을 만들어 Tailwind CSS를 적용시킵니다. src/styles/app.css1234// 아래 코드 모두 추가@tailwind base;@tailwind components;@tailwind utilities; 그 후, main.js에 app.css를 적용시킵니다. main.js12345import { createApp } from 'vue'import App from './App.vue'import './styles/app.css'; // 이 코드 추가createApp(App).mount('#app') 3-4. Tailwind CSS 적용 확인 App.vue, HelloWorld.vue 둘 다 기본 작성된 CSS는 지우고, 둘 중 하나에 Tailwind CSS가 적용이 잘 됐는지 테스트합니다. HelloWorld.vue1234567891011&lt;template&gt;&lt;div class=&quot;hello&quot;&gt; &lt;!-- 해당 요소 내 텍스트를 파란색으로 바꿈 --&gt; &lt;h1 class=&quot;text-blue-700&quot;&gt;{{ msg }}&lt;/h1&gt; ...&lt;/div&gt;&lt;/template&gt;&lt;script&gt; ...&lt;/script&gt; 확인 하면 제대로 적용 된 걸 볼 수 있습니다. [3] 참고 사이트 MS 공식 자습서: 초보자를 위한 Vue.js How to Setup Tailwind CSS in Vue 3 Install Tailwind CSS with Vue 3 and Vite","link":"/2021/12/04/2021-12-04-001-how-to-setup-vue3-with-tailwindcss/"}],"tags":[{"name":"memo","slug":"memo","link":"/tags/memo/"},{"name":"初心者","slug":"初心者","link":"/tags/%E5%88%9D%E5%BF%83%E8%80%85/"},{"name":"初投稿","slug":"初投稿","link":"/tags/%E5%88%9D%E6%8A%95%E7%A8%BF/"},{"name":"첫 투고","slug":"첫-투고","link":"/tags/%EC%B2%AB-%ED%88%AC%EA%B3%A0/"},{"name":"첫 글","slug":"첫-글","link":"/tags/%EC%B2%AB-%EA%B8%80/"},{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"markdown","slug":"markdown","link":"/tags/markdown/"},{"name":"language","slug":"language","link":"/tags/language/"},{"name":"youtube","slug":"youtube","link":"/tags/youtube/"},{"name":"recommend","slug":"recommend","link":"/tags/recommend/"},{"name":"devops","slug":"devops","link":"/tags/devops/"},{"name":"agile","slug":"agile","link":"/tags/agile/"},{"name":"software_development_methodologies","slug":"software-development-methodologies","link":"/tags/software-development-methodologies/"},{"name":"on-premise","slug":"on-premise","link":"/tags/on-premise/"},{"name":"off-premise","slug":"off-premise","link":"/tags/off-premise/"},{"name":"클라우드","slug":"클라우드","link":"/tags/%ED%81%B4%EB%9D%BC%EC%9A%B0%EB%93%9C/"},{"name":"cloud","slug":"cloud","link":"/tags/cloud/"},{"name":"서버","slug":"서버","link":"/tags/%EC%84%9C%EB%B2%84/"},{"name":"server","slug":"server","link":"/tags/server/"},{"name":"클라우드 컴퓨팅","slug":"클라우드-컴퓨팅","link":"/tags/%ED%81%B4%EB%9D%BC%EC%9A%B0%EB%93%9C-%EC%BB%B4%ED%93%A8%ED%8C%85/"},{"name":"cloud computing","slug":"cloud-computing","link":"/tags/cloud-computing/"},{"name":"내 생각","slug":"내-생각","link":"/tags/%EB%82%B4-%EC%83%9D%EA%B0%81/"},{"name":"비전공","slug":"비전공","link":"/tags/%EB%B9%84%EC%A0%84%EA%B3%B5/"},{"name":"비전공 개발자","slug":"비전공-개발자","link":"/tags/%EB%B9%84%EC%A0%84%EA%B3%B5-%EA%B0%9C%EB%B0%9C%EC%9E%90/"},{"name":"국비 지원","slug":"국비-지원","link":"/tags/%EA%B5%AD%EB%B9%84-%EC%A7%80%EC%9B%90/"},{"name":"javascript","slug":"javascript","link":"/tags/javascript/"},{"name":"js","slug":"js","link":"/tags/js/"},{"name":"typescript","slug":"typescript","link":"/tags/typescript/"},{"name":"ts","slug":"ts","link":"/tags/ts/"},{"name":"compiler","slug":"compiler","link":"/tags/compiler/"},{"name":"compile","slug":"compile","link":"/tags/compile/"},{"name":"browser","slug":"browser","link":"/tags/browser/"},{"name":"principle-of-operation","slug":"principle-of-operation","link":"/tags/principle-of-operation/"},{"name":"spring boot","slug":"spring-boot","link":"/tags/spring-boot/"},{"name":"springboot","slug":"springboot","link":"/tags/springboot/"},{"name":"스프링","slug":"스프링","link":"/tags/%EC%8A%A4%ED%94%84%EB%A7%81/"},{"name":"스프링부트","slug":"스프링부트","link":"/tags/%EC%8A%A4%ED%94%84%EB%A7%81%EB%B6%80%ED%8A%B8/"},{"name":"spring","slug":"spring","link":"/tags/spring/"},{"name":"cors","slug":"cors","link":"/tags/cors/"},{"name":"교차 출처 리소스 공유","slug":"교차-출처-리소스-공유","link":"/tags/%EA%B5%90%EC%B0%A8-%EC%B6%9C%EC%B2%98-%EB%A6%AC%EC%86%8C%EC%8A%A4-%EA%B3%B5%EC%9C%A0/"},{"name":"csrf","slug":"csrf","link":"/tags/csrf/"},{"name":"sop","slug":"sop","link":"/tags/sop/"},{"name":"redux","slug":"redux","link":"/tags/redux/"},{"name":"react","slug":"react","link":"/tags/react/"},{"name":"framework","slug":"framework","link":"/tags/framework/"},{"name":"vue3","slug":"vue3","link":"/tags/vue3/"},{"name":"vue","slug":"vue","link":"/tags/vue/"},{"name":"frontend","slug":"frontend","link":"/tags/frontend/"},{"name":"cookie","slug":"cookie","link":"/tags/cookie/"},{"name":"session-storage","slug":"session-storage","link":"/tags/session-storage/"},{"name":"local-storage","slug":"local-storage","link":"/tags/local-storage/"},{"name":"aws","slug":"aws","link":"/tags/aws/"},{"name":"copilot","slug":"copilot","link":"/tags/copilot/"},{"name":"code whisperer","slug":"code-whisperer","link":"/tags/code-whisperer/"}],"categories":[{"name":"Memo","slug":"Memo","link":"/categories/Memo/"},{"name":"Hexo","slug":"Hexo","link":"/categories/Hexo/"},{"name":"Language","slug":"Language","link":"/categories/Language/"},{"name":"Recommend","slug":"Recommend","link":"/categories/Recommend/"},{"name":"Information","slug":"Information","link":"/categories/Information/"},{"name":"MarkDown","slug":"Language/MarkDown","link":"/categories/Language/MarkDown/"},{"name":"Javascript","slug":"Language/Javascript","link":"/categories/Language/Javascript/"},{"name":"Video","slug":"Recommend/Video","link":"/categories/Recommend/Video/"},{"name":"Framework","slug":"Framework","link":"/categories/Framework/"},{"name":"AWS","slug":"AWS","link":"/categories/AWS/"},{"name":"URL","slug":"Recommend/URL","link":"/categories/Recommend/URL/"},{"name":"Spring","slug":"Framework/Spring","link":"/categories/Framework/Spring/"},{"name":"Vue","slug":"Framework/Vue","link":"/categories/Framework/Vue/"}]}